---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Boolean)
source: html/a226efeb-5a09-0da5-c948-66f6dc331b4e.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

Sets the attribute value.

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	bool value
)
```

## Parameters
- **name** (`System.String`) - The attribute name.
- **value** (`System.Boolean`) - The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null